Revit 2024 API
MEPCurve.Diameter Property
The diameter of the MEP curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double Diameter { get; }
Visual Basic
Public ReadOnly Property Diameter As Double
	Get
Visual C++
public:
property double Diameter {
	double get ();
}
Remarks
This property is used to retrieve the diameter of the MEP curve.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the MEP curve's Shape is not round.
See Also
MEPCurve Class
Autodesk.Revit.DB Namespace